{
  "pages": {
    "navbar": {
      "about": "Über",
      "resume": "Lebenslauf",
      "portfolio": "Portfolio",
      "contact": "Kontakt"
    },
    "header": {
      "about": "Über Mich",
      "resume": "Lebenslauf",
      "portfolio": "Portfolio",
      "contact": "Kontakt"
    },
    "about_me": {
      "desc": {
        "p1": "Ich bin ein leidenschaftlicher Tech-Enthusiast, der in der Webentwicklung arbeitet und für das Frontend verantwortlich ist. Ich liebe es, komplexe Probleme in einfache, schöne und intuitive Funktionen umzuwandeln, um die Welt einfacher und angenehmer zu gestalten.",
        "p2": "Meine Aufgabe besteht darin, Ihre Website funktionsfähig, reaktionsschnell und benutzerfreundlich zu gestalten. Mit anderen Worten, ich setze Ihre Vorstellungen in die reale Welt um und präsentiere sie Ihren Kunden in Form von Websites und Webanwendungen.",
        "p3": "Darüber hinaus habe ich ein gutes Auge für Details und garantiere, dass das Ergebnis meiner Arbeit genauso ist wie das von mir bereitgestellte UI-Design."
      },
      "langs": {
        "title": "Sprachen",
        "lang1": "Englisch",
        "lang2": "Deutsch",
        "lang3": "Persisch",
        "profi": "Muttersprache"
      }
    },
    "resume": {
      "ex": {
        "title": "Berufserfahrung",
        "sub_title": "Hauptverantwortlichkeiten:",
        "job_1": {
          "position": "Junior Frontend-Entwicklerin",
          "date": "April 2022 – Dezember 2024",
          "details": "Raintech Holding / Vollzeit / Remote",
          "desc": "Dieses Unternehmen ist auf Versicherungstechnologien (Insurtech) spezialisiert und bietet Content-Management-Systeme (CMS) für Versicherungsunternehmen und Agenturen an. In dieser Position arbeite ich mit meinem Team zusammen, um effiziente und benutzerfreundliche Admin-Panels zu erstellen, um unseren Kunden ein unglaubliches Erlebnis zu bieten und ihnen dabei zu helfen, ihre Aufgaben und Kunden so effektiv wie möglich zu verwalten. Zusätzlich entwickeln wir Services, die es Kunden ermöglichen, Versicherungen für ihre Besitztümer wie Autos, Handys, Laptops und andere elektronische Geräte unabhängig und direkt über unsere Anwendungen abzuschließen.",
          "res": {
            "1": "- Frontend- und Backend-Entwicklung: Entwurf und Entwicklung von Single-Page-Anwendungen(SPA), die responsiv und benutzerfreundlich sind.",
            "2": "- Wiederverwendbare Komponenten & Tests: Entwicklung komplexer Komponenten (z.B. Formulare, Paginierung, Diagramme) inklusive Unit- und Integrationstests zur Sicherstellung der Funktionalität./ Codequalität & Optimierung: Verantwortung für die Codebasis durch hohe Standards, Dokumentation, Anwendung von Best Practices und Performance-Optimierung durch Refactoring. Wartung und Refactoring von Legacy-Code.",
            "3": "- Projekte: Entwicklung von Admin-Management-Dashboards für Versicherungsgesellschaften (Kfz-Versicherung) sowie einer Anwendung zur Überprüfung der technischen Gesundheit elektrischer Geräte wie Smartphones und Tablets. Zudem Erstellung einer Demo für diese Projekte."
          }
        },
        "job_2": {
          "position": "Frontend-Entwickler",
          "date": "September 2019 - heute",
          "details": "Freiberuflich / Remote",
          "desc": "Als freiberuflicher Entwickler hatte ich die Möglichkeit, praktische Erfahrungen in verschiedenen Projekten zu sammeln, darunter Bildungswebsites, Online-Shops und E-Commerce-Projekte. In dieser Rolle habe ich viel gelernt und mein Wissen nicht nur in technischen Bereichen, sondern auch in Kommunikationsfähigkeiten erweitert. Ich habe ein tiefes Verständnis für Marketing und Finanzaspekte gewonnen. Darüber hinaus habe ich meine Zeitmanagement-Fähigkeiten professionalisiert.",
          "res": {
            "1": "- Abschluss verschiedener Aufgaben für unterschiedliche Kunden, um ihnen eine verbesserte Frontend-Erfahrung zu bieten.",
            "2": "- Zusammenarbeit mit Entwicklungsteams und Verantwortung für Teile von Projekten sowie Refactoring von Quellcodes und Debugging."
          }
        }
      },
      "educ": {
        "title": "Bildung",
        "edu_1": {
          "location": "ONLINE BOOTCAMP - WEB ENTWICKLUNG",
          "date": "2020 – 2022",
          "desc": "Dieses Online-Bootcamp war ein Teilzeitprogramm, das ich neben meiner Vollzeitstelle als SEO-Spezialist absolviert habe. Während dieses Kurses habe ich Webtechnologien und die Entwicklung von Webanwendungen erlernt. Ich habe Kenntnisse in HTML, CSS und JavaScript sowie in React und TypeScript erworben. Zudem habe ich gelernt, wie man Codebasen mit GitHub verwaltet und pflegt – eine der wichtigsten Aspekte der Entwicklung, insbesondere in einem Team. Durch diesen Kurs habe ich außerdem grundlegende Kenntnisse in der Backend-Entwicklung erworben, darunter Node.js, MongoDB, Mongoose, MySQL und Express.js. Ich habe beeindruckende Benutzeroberflächen erstellt und meinen Lernfortschritt durch kleine Projekte und praktische Erfahrungen erfolgreich gesteigert."
        },
        "edu_2": {
          "location": "HIGH SCHOOL",
          "date": "2010 – 2014",
          "desc": "Ich habe 4 erfolgreiche Jahre auf der High School verbracht und mit hervorragenden Noten abgeschlossen. Tatsächlich handelt es sich bei der Schule, die ich besucht habe, um keine reguläre Schule. Die Schüler müssen eine Aufnahmeprüfung bestehen, um die Erlaubnis zum Studium an dieser High School zu erhalten."
        }
      },
      "tech_skills": {
        "title": "Technische Fähigkeiten"
      }
    },
    "contact": {
      "title": "Kontaktformular",
      "input_1": "Vollständiger Name",
      "input_2": "E-Mail-Adresse",
      "txt_area": "Ihre Nachricht",
      "btn": "Nachricht senden"
    },
    "portfolio": {
      "project1": {
        "header": "für eine Versicherungsgesellschaft"
      }
    }
  },

  "sidebar": {
    "job_title": "Frontend-Entwickler",
    "email": "E-Mail",
    "phone": "Telefon",
    "location": "Ort",
    "birth": "Geburtstag",
    "show_contact": "Kontakt anzeigen",
    "hide_contact": "Kontakt ausblenden"
  }
}
